{
  "name": "LINA RAGAUSKAITE",
  "title": "Full-stack TypeScript Developer & DevOps Engineer",
  "intro": "<strong>Eager to learn</strong>, <strong>curious</strong>, <strong>determined</strong> and <strong>responsible</strong> are four words that I believe describe me the best. I started programming from 10th grade and since then realised that Software Engineering is something I would be thrilled to work on daily for the rest of my life. Initially, I was focusing on Software Engineering,&nbsp;however with time, I gained a huge interest in Full-stack Development for both websites and mobile applications.<br /><br />Now I mostly work with <strong>Angular</strong>,&nbsp;<strong>Node.js and use Google Cloud Platform.</strong>&nbsp;Also I'm learning GoLang to have more experience working with native programming languages.<br />I enjoy working on both sides of the spectrum, Front-end and Back-end, however, if I had to make a choice, I would pick Back-end and DevOps, as I find it more interesting, because it's potentially more complex and challenging than Front-end can be. I <strong>constantly work on improving my skills and knowledge</strong> and enjoy learning new and better ways of solving problems and accomplishing tasks. As a result, with every new personal project, I aim to include at least one feature/problem that will require a solution for which I will have to learn something new.<br /><br />Besides coding, I also like to work with graphic design software and pervasive systems.<br /><br /> I work well both in teams and on my own and have <strong>experience working in Agile environment</strong>. I'm also an active person and love outdoor and indoor activities.",
  "availability": "",
  "contacts": {
    "location": {
      "value": "Sutton Coldfield, UK",
      "img": "assets/icons/ic-place.svg"
    },
    "email": {
      "value": "ragauskl@gmail.com",
      "img": "assets/icons/ic-email.svg"
    },
    "mobile": {
      "value": "+44 749 205 1761",
      "img": "assets/icons/ic-phone.svg"
    },
    "linkedin": {
      "value": "linkedin.com/in/ragauskl/",
      "img": "assets/icons/linkedin.svg"
    },
    "github": {
      "value": "github.com/ragauskl",
      "img": "assets/icons/github.svg"
    }
  },
  "projects": [{
    "name": "Personal Portfolio",
    "date": "2019",
    "liveLink": "https://lina.codes",
    "job": "Full-stack Typescript development and DevOps",
    "description": "Currently under development, to be released in mid/end of spring. Development is done using <strong>Angular, Node.js and MongoDB</strong>. Front-end is hosted using Github Pages and Back-end with database are hosted on <strong>Heroku</strong>"
  }, {
    "name": "Route Fox",
    "date": "2018 1st Quarter",
    "job": "Mobile Full-stack development",
    "demoLink": "https://youtu.be/9NwdTCJON8U",
    "description": "Dissertation project - a mobile travel recommender system, that generates route suggestions between 2+ points of interests, based on the user preferences such as visit length for every place, arrival and departure preferences, the priority of each place as well as preferred transport type. The mobile application also has a feature to live-track a saved route and warn the user if wandering off too far away from the selected path. The mobile application has been built using <b>Ionic 3 (Angular 5)</b> and the API has been built using <b>Node.js</b>. Application data is stored in a <b>MongoDB</b> database. For this project, <b>Google Maps</b>, <b>Directions</b> and <b>Places APIs</b> were used."
  }, {
    "name": "Environment monitoring system",
    "date": "2018 1st Quarter",
    "job": "API development and Embedded System support",
    "description": "Project for Agile Development module - for this project I was assigned to a team of students with various skills, our goal was to develop a hardware box with <b>ESP8266</b> and various <b>environment monitoring sensors</b>, API connected to a database and a Front-end mobile application to allow access to environment data and sensor box information depending on user access level. I was responsible for developing the API, creating a database as well as providing support to hardware team. To build API I used <b>NodeJS</b>, and two communication protocols: <b>HTTP</b> for Front-end requests and <b>MQMT</b> for communication with the sensor box. For database solution, we agreed to use <b>MongoDB</b>. To perform unit testing <b>Jasmine</b> was used."
  }],
  "experience": [{
    "company": "Geospatial Insight Limited, Coleshill",
    "img": "assets/geospatial-logo.png",
    "job": "Full-stack JavaScript Developer",
    "report": "Reporting to Manager of Software, Analytics and Machine Learning",
    "from": "Jun 2018",
    "to": "Present",
    "length": "",
    "description": "Working as part of the team developing tools used to display and manipulate a wide range of geospatial data collected from satellites, plane and drone imagery which is analysed by GSI Machine Learning team to produce insight into the collected data. Main GSI product being&nbsp;<strong>Visual Intelligence Platform</strong>. I'm responsible for developing new features, testing, deploying and maintaining the system. Technology used mainly includes&nbsp;<strong>Angular, Node.js, Postgres, Kubernetes, Gitlab CI and Google Cloud Platform</strong>.<br /><br />Other responsibilities include code quality reviews,&nbsp;project scope planning and review meetings, keeping planned tasks up-to-date in Jira and writing documentation."
  }, {
    "company": "Sorion Electronics Limited, Birmingham",
    "img": "assets/sorion-logo.png",
    "job": "Undergraduate Software Engineer",
    "report": "Reported to System Director and Software Team Manager",
    "from": "Jun 2016",
    "to": "Oct 2017",
    "length": "1 yr 3 mos",
    "description": "Responsible for development and maintenance of new features for the company's core product - Sextans-Rt. This involved keeping up-to-date documentation, preparing presentations, participating in regular meetings and technical reviews, writing scripts and sometimes visiting customers site. Projects were written in C#.Net/VB.Net and included the use of Subversion, TCP/IP, FTP and Microsoft SQL Server.<br /><br />Some of the projects I have worked on include a <b>Pick-To-Light System</b> (a light-directed aid for the production line), a <b>Multi-Language Support Tool</b> for the Sextans-RT and a <b>Layered Image Editor</b>."
  }],
  "languages": [{
    "name": "English",
    "level": "Fluent"
  }, {
    "name": "Russian",
    "level": "Fluent"
  }, {
    "name": "Lithuanian",
    "level": "Native"
  }, {
    "name": "German",
    "level": "Lower intermediate"
  }],
  "education": {
    "img": "assets/cov-uni.png",
    "university": "Coventry Univeristy",
    "course": "1st Class 'Computing' Bachelor of Science",
    "from": 2014,
    "to": 2018,
    "modules": [
      "Full-stack development",
      "Programming, algorithms and data structures",
      "Computer architecture and networks",
      "Interactive pervasive computing",
      "Design for usability",
      "Agile development",
      "Intelligent agents",
      "Enterprise information systems",
      "German lower intermediate"
    ]
  }

}
